#+title: From Snap! to Python (practice)
#+subtitle: UBMS Snap! Programming Summer 2023
#+options: toc:nil num:nil ^:nil
#+startup: overview hideblocks indent inlineimages
#+property: header-args:python :results output :noweb yes
:REVEAL_PROPERTIES:
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_REVEAL_JS_VERSION: 4
#+REVEAL_INIT_OPTIONS: transition: 'cube'
#+REVEAL_THEME: black
:END:
* Randomize ~babynames~ dataset

#+begin_src python
  import pandas as pd

  # Load the CSV data into a pandas DataFrame
  data = pd.read_csv('../data/babynames_original.csv')

  # Randomize the DataFrame
  data = data.sample(frac=1).reset_index(drop=True)

  # Save the randomized DataFrame back to a CSV file
  data.to_csv('../data/babynames.csv', index=False)

  # Show data frame
  print(data)
#+end_src

#+RESULTS:
#+begin_example
        year     name   percent   sex
0       1904    Selma  0.000790  girl
1       2002  Xzavier  0.000112   boy
2       2006    Kadyn  0.000094   boy
3       1965      Von  0.000049   boy
4       1974     Abel  0.000202   boy
...      ...      ...       ...   ...
257995  1920  Queenie  0.000053  girl
257996  1982     Wade  0.000351   boy
257997  1988   Lesley  0.000250  girl
257998  1943     Vada  0.000061  girl
257999  1942     Eloy  0.000039   boy

[258000 rows x 4 columns]
#+end_example

* Practice yourself with ~babynames~

Transfer the code from the previous section to a new dataset.

This practice file (without answers) is available in Colab as:
[[https://tinyurl.com/babyNamesColab][tinyurl.com/babyNamesColab]].

The solution file is here: [[https://tinyurl.com/babyNamesNotebook][tinyurl.com/babyNamesNotebook]].

1) Download this file of baby names to your PC as ~babynames.csv~:
   [[https://tinyurl.com/babyNamesRandomized][tinyurl.com/babyNamesRandomized]]

2) Import the file from your ~Downloads~ directory to a data frame named
   ~baby~.
   #+name: baby
   #+begin_src python :results silent
     import pandas as pd
     import matplotlib.pyplot as plt
     baby = pd.read_csv("../data/babynames.csv")
   #+end_src

3) Print the data frame to make sure the import worked - how many
   names does this data set contain?
   #+begin_src python
     <<baby>>
     print(baby)
   #+end_src

   #+RESULTS:
   #+begin_example
           year     name   percent   sex
   0       1904    Selma  0.000790  girl
   1       2002  Xzavier  0.000112   boy
   2       2006    Kadyn  0.000094   boy
   3       1965      Von  0.000049   boy
   4       1974     Abel  0.000202   boy
   ...      ...      ...       ...   ...
   257995  1920  Queenie  0.000053  girl
   257996  1982     Wade  0.000351   boy
   257997  1988   Lesley  0.000250  girl
   257998  1943     Vada  0.000061  girl
   257999  1942     Eloy  0.000039   boy

   [258000 rows x 4 columns]
   #+end_example

4) There is only one numeric column, the ~percent~ (of records that
   #+begin_src python
     <<baby>>
     print(baby.iloc[:,2].describe())
     print(baby.loc[:,'year'].min())
     print(baby.loc[:,'year'].max())
   #+end_src

   #+RESULTS:
   #+begin_example
   count    258000.000000
   mean          0.000894
   std           0.003016
   min           0.000026
   25%           0.000081
   50%           0.000164
   75%           0.000507
   max           0.081541
   Name: percent, dtype: float64
   1880
   2008
   #+end_example

5) Make a /horizontal/ boxplot of ~percent~ values of the
   data set (remember that you need to import the graphics library and
   its plotting module):
   #+begin_src python :results silent
     <<baby>>
     plt.boxplot(baby[:100]['percent'],vert=False)
     plt.show()
   #+end_src

6) I had randomized the ~babynames~ data set and removed the groupings
   of years and sex - from the result, you can see that, at least
   among the first 100 names, there are a few outliers - names that
   are massively more popular than the lot, while the rest of the
   names are close together. To see better, one can transform the
   values logarithmically using the ~numpy~ package:
   #+begin_src python :results silent
     <<baby>>
     import numpy as np
     baby_log = baby
     baby_log['percent'] = np.log10(baby['percent'])
     plt.boxplot(baby_log[:100]['percent'],vert=False)
     plt.show()
   #+end_src

7) Make a /scatterplot/ of the ~percent~ values: for the x-argument of the
   ~plt.scatter~ function use the ~index~, which is stored in ~baby.index~:
   #+begin_src python :results silent
     <<baby>>
     plt.scatter(baby.index,baby.percent)
     plt.show()
   #+end_src

8) It's very hard to see any trends with so many data points! Plot
   again but this time limit the number of data points to 100:
   #+begin_src python :results silent
     <<baby>>
     plt.scatter(baby.index[:100],baby.percent[:100])
     plt.show()
   #+end_src

9) To see this better, you can sort the values in descending order
   using ~sort_values~:
   #+begin_src python :results silent
     <<baby>>
     baby = baby.sort_values(by='percent',ascending=False).reset_index(drop=True)
     baby_top100 = baby[:100]
     plt.scatter(baby_top100.index,baby_top100.percent)
     plt.show()
   #+end_src

10) Print the functions that you used with the corresponding magic
    command.
    #+begin_example ipython
      %whos
    #+end_example

11) Lastly, save a Python (~.py~) version of your code to your PC. You
    can now run this code from the terminal or from within IDLE.

